Show / Hide Table of Contents
Class RebarGeneral
Represents a single main rebar in 3D space. Holds data from generated rebar or rebar imported from Tekla. the rebarShape is in global coordinates and it is not possible to prject it along Member1D, Polyline, ... (referenceLine)
Inheritance
System.Object
OpenObject
OpenElementId
RebarBase
RebarGeneral
Inherited Members
 RebarBase.Material
 RebarBase.Diameter
 RebarBase.RebarShape
 RebarBase.RebarParentElement
 RebarBase.RebarAllocationElement
 RebarBase.GroupId
 OpenElementId.Id
 System.Object.ToString()
 System.Object.Equals(System.Object)
 System.Object.Equals(System.Object, System.Object)
 System.Object.ReferenceEquals(System.Object, System.Object)
 System.Object.GetHashCode()
 System.Object.GetType()
 System.Object.MemberwiseClone()
Namespace: IdeaRS.OpenModel.Model
Assembly: IdeaRS.OpenModel.dll
Syntax
[OpenModelClass("CI.StructModel.Structure.RebarGeneral,CI.StructuralElements", "CI.StructModel.Structure.IRebarGeneral,CI.BasicTypes")]
public class RebarGeneral : RebarBase
Constructors
Improve this Doc   View Source
RebarGeneral()
create a new instance.
Declaration
public RebarGeneral()
Properties
Improve this Doc   View Source
PlaneNormal
Normal vector of the plane where the rebar lie. Used to deterine if this rebar is stirrup.
Declaration
public Vector3D PlaneNormal { get; set; }
Property Value
 Type |  Description
 Vector3D
Improve this Doc   View Source
RebarType
Rebar type
Declaration
public RebarGeneralType RebarType { get; set; }
Property Value
 Type |  Description
 RebarGeneralType
 Improve this Doc
 View Source